# Ch 10: Data Aggregation and Group Operations

Chapter 10
* Grouping with Dicts/Series
* Grouping with Functions
* Grouping with Index Levels
* Split/Apply/Combine
* Cross Tabs

In [1]:
import pandas as pd
import numpy as np
import statsmodels.api as sm
from io import StringIO

## 10.1 GroupBy Mechanics

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.683073  0.358981
1    a  two -0.942143 -0.349922
2    b  one  0.683577  0.302753
3    b  two -1.656013 -0.044668
4    a  one  1.818103 -0.398432

Access 'data1' and call `.groupby()` with the column at 'key1':

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

Compute the group means by calling GroupBy's `.mean()` method:

In [4]:
grouped.mean()

key1
a    0.519677
b   -0.486218
Name: data1, dtype: float64

Try passing multiple arrays as a list instead:

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.250588
      two    -0.942143
b     one     0.683577
      two    -1.656013
Name: data1, dtype: float64

The resulting Series now has a hierarchical index.

In [6]:
means.unstack()

key2       one       two
key1
a     1.250588 -0.942143
b     0.683577 -1.656013

Instead of Series, group keys can also be arrays (of the right length):

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [8]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.942143
            2006    0.683577
Ohio        2005   -0.486470
            2006    1.818103
Name: data1, dtype: float64

In [9]:
df

  key1 key2     data1     data2
0    a  one  0.683073  0.358981
1    a  two -0.942143 -0.349922
2    b  one  0.683577  0.302753
3    b  two -1.656013 -0.044668
4    a  one  1.818103 -0.398432

You can pass column names as the group keys:

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.519677 -0.129791
b    -0.486218  0.129042

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   1.250588 -0.019725
     two  -0.942143 -0.349922
b    one   0.683577  0.302753
     two  -1.656013 -0.044668

Use the GroupBy method `.size()` to return group sizes:

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [13]:
df['data1'].groupby([states, years]).size()

California  2005    1
            2006    1
Ohio        2005    2
            2006    1
Name: data1, dtype: int64

### Iterating Over Groups

In [14]:
df

  key1 key2     data1     data2
0    a  one  0.683073  0.358981
1    a  two -0.942143 -0.349922
2    b  one  0.683577  0.302753
3    b  two -1.656013 -0.044668
4    a  one  1.818103 -0.398432

The GroupBy object generates 2-tuples, containing the group name and the chunk of data:

In [15]:
for name, group in df.groupby('key1'):
    print("Name:\n", name)
    print("Group:\n", group)

Name:
 a
Group:
   key1 key2     data1     data2
0    a  one  0.683073  0.358981
1    a  two -0.942143 -0.349922
4    a  one  1.818103 -0.398432
Name:
 b
Group:
   key1 key2     data1     data2
2    b  one  0.683577  0.302753
3    b  two -1.656013 -0.044668

With multiple keys, the first element will be a tuple of key values:

In [16]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print("Key values:\n", (k1, k2))
    print("Group:\n", group)

Key values:
 ('a', 'one')
Group:
   key1 key2     data1     data2
0    a  one  0.683073  0.358981
4    a  one  1.818103 -0.398432
Key values:
 ('a', 'two')
Group:
   key1 key2     data1     data2
1    a  two -0.942143 -0.349922
Key values:
 ('b', 'one')
Group:
   key1 key2     data1     data2
2    b  one  0.683577  0.302753
Key values:
 ('b', 'two')
Group:
   key1 key2     data1     data2
3    b  two -1.656013 -0.044668

You can compute a dict of the data pieces as a one-liner:

In [17]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one  0.683577  0.302753
3    b  two -1.656013 -0.044668

In [18]:
dict(list(df.groupby('key1')))

{'a':   key1 key2     data1     data2
 0    a  one  0.683073  0.358981
 1    a  two -0.942143 -0.349922
 4    a  one  1.818103 -0.398432,
 'b':   key1 key2     data1     data2
 2    b  one  0.683577  0.302753
 3    b  two -1.656013 -0.044668}

`.groupby()` groups by `axis=0` by default, but you can group on other axes.  
Group the columns by `dtype`:

In [19]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [20]:
grouped = df.groupby(df.dtypes, axis=1)
grouped

In [21]:
for dtype, group in grouped:
    print("Dtype:\n", dtype)
    print("Group:\n", group)

Dtype:
 float64
Group:
       data1     data2
0  0.683073  0.358981
1 -0.942143 -0.349922
2  0.683577  0.302753
3 -1.656013 -0.044668
4  1.818103 -0.398432
Dtype:
 object
Group:
   key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Selecting a Column or Subset of Columns

In [22]:
df.groupby('key1')['data1']
# is syntactic sugar for:
df['data1'].groupby(df['key1'])

And

In [23]:
df.groupby('key1')[['data2']]
# is syntactic sugar for:
df[['data2']].groupby(df['key1'])

In [24]:
type(df['data1'])

pandas.core.series.Series

In [25]:
type(df[['data1']])

pandas.core.frame.DataFrame

To compute means for just the `data2` column *and* get the result as a DF:

In [26]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one    -0.019725
      two    -0.349922
b     one     0.302753
      two    -0.044668
Name: data2, dtype: float64

In [27]:
df.groupby('key1')['data2'].mean()

key1
a   -0.129791
b    0.129042
Name: data2, dtype: float64

In [28]:
type(df.groupby(['key1', 'key2'])['data2'].mean())

pandas.core.series.Series

In [29]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [30]:
s_grouped.mean()

key1  key2
a     one    -0.019725
      two    -0.349922
b     one     0.302753
      two    -0.044668
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [31]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan # add some null values
people

               a         b         c         d         e
Joe     0.272228 -0.863828  2.402915  0.745461 -0.355993
Steve  -1.594365 -0.517332  0.046509  0.355796 -1.191839
Wes     0.090543       NaN       NaN -0.446297  0.283626
Jim    -1.114270  0.885784 -0.393895 -1.372546 -1.462724
Travis  0.279778 -0.582746  0.237554 -1.123309  2.296183

Suppose you want to sum the columns by group:

In [32]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

Just pass the dict:

In [33]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     3.148376 -0.947593
Steve   0.402305 -3.303537
Wes    -0.446297  0.374169
Jim    -1.766441 -1.691210
Travis -0.885754  1.993215

Doing the same w/Series can be thought of as a fixed-size mapping:

In [34]:
mapSeries = pd.Series(mapping)
mapSeries

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [35]:
people.groupby(mapSeries, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### Grouping with Functions

In [36]:
people.index

Index(['Joe', 'Steve', 'Wes', 'Jim', 'Travis'], dtype='object')

Group by length of names:

In [37]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.751499  0.021956  2.009020 -1.073381 -1.535092
5 -1.594365 -0.517332  0.046509  0.355796 -1.191839
6  0.279778 -0.582746  0.237554 -1.123309  2.296183

Everything (arrays, dicts, Series) gets converted to arrays internallY:

In [38]:
keyList = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, keyList]).min()

              a         b         c         d         e
3 one  0.090543 -0.863828  2.402915 -0.446297 -0.355993
  two -1.114270  0.885784 -0.393895 -1.372546 -1.462724
5 one -1.594365 -0.517332  0.046509  0.355796 -1.191839
6 two  0.279778 -0.582746  0.237554 -1.123309  2.296183

### Grouping by Index Levels

Aggregate using one of the levels of an axis index:

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [40]:
hierDF = pd.DataFrame(np.random.randn(4, 5), columns = columns)
hierDF

cty          US                            JP
tenor         1         3         5         1         3
0      0.821718 -1.075888 -0.366179  1.685626  1.901745
1     -1.243579  0.612391  0.772314 -1.450223 -1.842159
2     -0.139088  0.497674  0.137759  0.511370 -2.808358
3     -0.900473 -0.108379 -1.432572  0.000770  0.500222

To group by level, pass the level number (or name) using the `level` keyword:

In [41]:
hierDF.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2 Data Aggregation

In [42]:
df

  key1 key2     data1     data2
0    a  one  0.683073  0.358981
1    a  two -0.942143 -0.349922
2    b  one  0.683577  0.302753
3    b  two -1.656013 -0.044668
4    a  one  1.818103 -0.398432

In [43]:
grouped = df.groupby('key1')

In [44]:
grouped['data1'].quantile(0.9)

key1
a    1.591097
b    0.449618
Name: data1, dtype: float64

Use your own aggregation functions that aggregate an array to the `aggregate` or `agg` method:

In [45]:
def peakToPeak(arr):
    return arr.max() - arr.min()

grouped.agg(peakToPeak)

         data1     data2
key1
a     2.760246  0.757413
b     2.339590  0.347421

Though not technically aggregations, methods like `describe` also work:

In [46]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.519677  1.387358 -0.942143 -0.129535  0.683073  1.250588
b      2.0 -0.486218  1.654340 -1.656013 -1.071116 -0.486218  0.098679

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.818103   3.0 -0.129791  0.423983 -0.398432 -0.374177 -0.349922
b     0.683577   2.0  0.129042  0.245664 -0.044668  0.042187  0.129042


           75%       max
key1
a     0.004530  0.358981
b     0.215897  0.302753

### Column-Wise and Multiple Function Application

Load the tipping dataset:

In [47]:
tips = pd.read_csv('tips.csv')

# Add tip %age of total bill:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

Group `tips` by `day` and `smoker`:

In [48]:
grouped = tips.groupby(['day', 'smoker'])

Get the average tip percent by group:

In [49]:
groupedPct = grouped['tip_pct']
groupedPct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

If you pass a list of functions / function names, you get a DF returned:

In [50]:
groupedPct.agg(['mean', 'std', peakToPeak])

                 mean       std  peakToPeak
day  smoker
Fri  No      0.151650  0.028123    0.067349
     Yes     0.174783  0.051293    0.159925
Sat  No      0.158048  0.039767    0.235193
     Yes     0.147906  0.061375    0.290095
Sun  No      0.160113  0.042347    0.193226
     Yes     0.187250  0.154134    0.644685
Thur No      0.160298  0.038774    0.193350
     Yes     0.163863  0.039389    0.151240

Rename the columns by passing a list of (name, function) tuples instead:

In [51]:
groupedPct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

You can pass a list of functions to all columns, *or* you can specify different functions per column.  
Compute the previous stats for 'tip_pct' and 'total_bill' columns:

In [52]:
functions = ['count', 'mean', 'max']
result = grouped[['tip_pct', 'total_bill']].agg(functions) # Note: added extra [] to avoid deprecation issue
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [53]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

Again, a list of tuples w/custom names can be passed:

In [54]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)] # Durchschnitt: average; Abweichung: deviation
grouped[['tip_pct', 'total_bill']].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

To apply different functions to diffeerent columns, pass a dict to `agg` with a mapping of column names to the functions:

In [55]:
grouped.agg({'tip': np.max, 'size': 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

Let's try something...

In [56]:
grouped.agg({'tip': (np.max, np.min), 'size': 'sum'})

               tip       size
              amax  amin  sum
day  smoker
Fri  No       3.50  1.50    9
     Yes      4.73  1.00   31
Sat  No       9.00  1.00  115
     Yes     10.00  1.00  104
Sun  No       6.00  1.01  167
     Yes      6.50  1.50   49
Thur No       6.70  1.25  112
     Yes      5.00  2.00   40

In [57]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'], 'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### Returning Aggregated Data Without Row Indexes

Disable row indexing by passing `as_index=False` to groupby:

In [58]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## 10.3 Apply: General split-apply-combine

Write a function to select the rows with the rows with the 5 largest values in a column:

In [59]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [63]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

Group by 'smoker' and call `.apply()` with this function:

In [65]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

If you pass a function to `apply` that takes other arguments or keywords, you can pass these after the function:

In [66]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

Calling `.describe()` on a GroupBy object:

In [67]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [68]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

...is a shortcut for:

In [69]:
f = lambda x: x.describe()
grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

### Suppressing the Group Keys

You can disable the hierarchical index by passing `group_keys=False` to groupby:

In [70]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [71]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

### Quantile and Bucket Analysis

Consider a simple random dataset and an equal-length bucket categorization using `cut`:

In [72]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0      (0.0241, 1.55]
1    (-1.501, 0.0241]
2       (1.55, 3.075]
3       (1.55, 3.075]
4      (0.0241, 1.55]
5    (-1.501, 0.0241]
6      (0.0241, 1.55]
7    (-1.501, 0.0241]
8      (0.0241, 1.55]
9    (-1.501, 0.0241]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.033, -1.501] < (-1.501, 0.0241] < (0.0241, 1.55] < (1.55, 3.075]]

The **Categorical** object returned by `cut` can be passed directly to `groupby`.  

Compute a set of statistics for 'data2':

In [75]:
def getStats(group):
    return {'min': group.min(), 'max': group.max(), 
           'count': group.count(), 'mean': group.mean()}

grouped = frame.data2.groupby(quartiles)

In [76]:
grouped.apply(getStats).unstack()

                       min       max  count      mean
data1
(-3.033, -1.501] -2.096412  1.798080   71.0 -0.097230
(-1.501, 0.0241] -2.941574  3.569164  453.0  0.050776
(0.0241, 1.55]   -2.898227  3.576859  413.0  0.025899
(1.55, 3.075]    -1.998338  2.589312   63.0  0.273390

These were equal **length** buckets. Use `qcut` to compute equal **size** buckets:

In [78]:
# Return quantile numbers:
grouping = pd.qcut(frame.data1, 10, labels=False)

grouped = frame.data2.groupby(grouping)

grouped.apply(getStats).unstack()

            min       max  count      mean
data1
0     -2.096412  1.798080  100.0 -0.077482
1     -2.258966  2.279399  100.0  0.173018
2     -2.057910  3.569164  100.0  0.206557
3     -2.190474  2.349391  100.0 -0.103556
4     -1.941288  2.412183  100.0  0.013163
5     -2.941574  2.362795  100.0  0.153113
6     -2.306616  2.350290  100.0 -0.125720
7     -2.898227  2.933265  100.0  0.096007
8     -2.592064  3.576859  100.0  0.046469
9     -1.998338  2.607732  100.0  0.058611

### Example: Filling Missing Values with Group-Specific Values

Instead of eliminating NaNs with `dropna` you may wish to impute them with `fillna`:

In [81]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1   -0.270188
2         NaN
3    1.168131
4         NaN
5    1.455831
dtype: float64

In [82]:
s.fillna(s.mean())

0    0.784591
1   -0.270188
2    0.784591
3    1.168131
4    0.784591
5    1.455831
dtype: float64

If you need the fill data to vary by group, use `apply` with a function that calls `fillna` on each data chunk:

In [85]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
groupKey = ['East'] * 4 + ['West'] * 4
groupKey

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [86]:
data = pd.Series(np.random.randn(8), index=states)
data

Ohio          0.636005
New York     -0.204030
Vermont      -0.829614
Florida      -0.206486
Oregon        1.154910
Nevada       -1.083981
California    0.060706
Idaho        -0.687418
dtype: float64

Set some missing values:

In [89]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.636005
New York     -0.204030
Vermont            NaN
Florida      -0.206486
Oregon        1.154910
Nevada             NaN
California    0.060706
Idaho              NaN
dtype: float64

In [90]:
data.groupby(groupKey).mean()

East    0.075163
West    0.607808
dtype: float64

Fill the NaNs with the group means:

In [91]:
fillMean = lambda g: g.fillna(g.mean())

In [92]:
data.groupby(groupKey).apply(fillMean)

Ohio          0.636005
New York     -0.204030
Vermont       0.075163
Florida      -0.206486
Oregon        1.154910
Nevada        0.607808
California    0.060706
Idaho         0.607808
dtype: float64

Or use the group's name attribute to assign predefined values:

In [93]:
fillVals = {'East': 0.5, 'West': -1}
fillFunc = lambda g: g.fillna(fillVals[g.name])

In [94]:
data.groupby(groupKey).apply(fillFunc)

Ohio          0.636005
New York     -0.204030
Vermont       0.500000
Florida      -0.206486
Oregon        1.154910
Nevada       -1.000000
California    0.060706
Idaho        -1.000000
dtype: float64

### Example: Random Sampling and Permutation

Draw a random sample from a standard DoC:

In [105]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'Q', 'K']
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

cards[:13]

['AH', '2H', '3H', '4H', '5H', '6H', '7H', '8H', '9H', '10H', 'JH', 'QH', 'KH']

In [103]:
deck = pd.Series(card_val, index=cards)
deck.head(13)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
QH     10
KH     10
dtype: int64

Draw a hand of 5 cards, randomly from the deck:

In [106]:
def draw(deck, n=5):
    return deck.sample(n)

draw(deck)

5S     5
9S     9
2C     2
6S     6
QH    10
dtype: int64

Suppose you want 2 random cards from each suit:

In [107]:
getSuit = lambda card: card[-1]  # last letter is suit

In [108]:
deck.groupby(getSuit).apply(draw, n=2)

C  7C     7
   KC    10
D  JD    10
   8D     8
H  9H     9
   5H     5
S  3S     3
   JS    10
dtype: int64

Alternatively:

In [109]:
deck.groupby(getSuit, group_keys=False).apply(draw, n=2)

3C    3
2C    2
7D    7
6D    6
5H    5
4H    4
3S    3
8S    8
dtype: int64

### Example: Group Weighted Average and Correlation

In [110]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

  category      data   weights
0        a -2.014366  0.771178
1        a  2.201927  0.514756
2        a  1.611754  0.227375
3        a -0.261129  0.381763
4        b -0.264649  0.646904
5        b -0.739185  0.887120
6        b  0.538833  0.183730
7        b  0.683382  0.926631

Group weighted average by category:

In [111]:
grouped = df.groupby('category')
getWavg = lambda g: np.average(g['data'], weights=g['weights'])

In [112]:
grouped.apply(getWavg)

category
a   -0.080841
b   -0.035814
dtype: float64

Consider financial datasets:

In [113]:
closePx = pd.read_csv('stock_px_2.csv', parse_dates=True, index_col=0)
closePx.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [114]:
closePx[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

Compute a DF consisting of the yearly correlations of daily returns with SPX.  
First create a function to compute the pairwise correlation of each column with the 'SPX' column:

In [115]:
spxCorr = lambda x: x.corrwith(x['SPX'])

Compute the % change on 'close_px' using `pct_change`:

In [117]:
rets = closePx.pct_change().dropna()

Group % changes by year by returning the `year` attribute of the `datetime` label:

In [118]:
getYear = lambda x: x.year
byYear = rets.groupby(getYear)
byYear.apply(spxCorr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

Also, compute inter-column correlations:

In [119]:
byYear.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

### Example: Group-Wise Linear Regression

Define a regression function that executes ordinary least squares (OLS) regression on each chunk of data:

In [120]:
import statsmodels.api as sm

In [121]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1
    result = sm.OLS(Y, X).fit()
    return result.params

Now run a yearly regression of AAPL on SPX:

In [122]:
byYear.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

## 10.4 Pivot Tables and Cross-Tabulation

Compute a table of group means arranged by *day* and *smoker*:

In [123]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

If you want to aggregate only *tip_pct* and *size* and group by *time*, put *smoker* in the columns and *day* in the rows:

In [124]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

Augment the table by passing `margins=True`, which adds **All** row and column labels, with corresponding values being the group stats for all the data within a single tier:

In [125]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

Pass the `aggfunc='count'` or `len` to get the count or frequency of group sizes:

In [126]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [128]:
# same:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc='count', margins=True)

day             Fri   Sat   Sun  Thur  All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106
       Yes      9.0  42.0  19.0   NaN   70
Lunch  No       1.0   NaN   NaN  44.0   45
       Yes      6.0   NaN   NaN  17.0   23
All            19.0  87.0  76.0  62.0  244

Can also pass a `fill_value` to fill in the NaNs:

In [129]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

### Cross-Tabulations: Crosstab

A crosstab is a special case of a pivot table that computes group frequencies:

In [131]:
from io import StringIO

In [132]:
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')

In [133]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

Could use pivot_table to summarize nationality and handedness, but `pd.crosstab()` is more convenient:

In [134]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

Arguments to `crosstab` can be array, Series, or list of arrays:

In [135]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

## 10.5 Conclusion

More on `groupby` in Ch 14.  
Next up: **time series data**